NextFOAM-2606/tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/laminar/1_Inlet_2_Outlet_Dual_Bottleneck/losses-mass-30-70/reEval/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes     
{
    default         Gauss linear;
    gradUConv       cellLimited Gauss linear 1;
}

divSchemes      
{
    default            Gauss linear;
    div(phi,U)         bounded Gauss linearUpwind gradUConv;
   "div\(-phi,Ua.*\)"  bounded Gauss linearUpwind gradUConv;
}

interpolationSchemes 
{
    default         linear;
}
laplacianSchemes 
{
    default         Gauss linear corrected;
}
snGradSchemes   
{
    default         corrected;
}

// ************************************************************************* //
